BRB_Documentation/docs/SOAP/20130829_Adjudication Success.txt

--Adjudication Request
<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>ACCOUNT_APPLICATION</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
                <p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
                    <RequestBody>
<![CDATA[
<AccountApplicationRequest>
  <externalReferenceId>1377789043057</externalReferenceId>
  <storeNumber>0500</storeNumber>
  <agentId>MQSYS</agentId>
  <channelIndicator>WP</channelIndicator>
  <agencyPromoCode></agencyPromoCode>
  <acquistionStrategyCode>005577</acquistionStrategyCode>
  <requestedProductType>OMC</requestedProductType>
  <firstName>BREDITU</firstName>
  <lastName>PERIWINKLE</lastName>
  <middleInitial></middleInitial>
  <dateOfBirth>1970-04-17</dateOfBirth>
  <sin></sin>
  <idType>DR</idType>
  <idNumber>BRB</idNumber>
  <placeOfIssue>AB</placeOfIssue>
  <preferedLanguage>E</preferedLanguage>
  <applicantGender>M</applicantGender>
  <currentAddressType>M</currentAddressType>
  <currentAddressLine1>1 LEACOCK COURT</currentAddressLine1>
  <currentAddressLine2></currentAddressLine2>
  <currentCity>DARTMOUTH</currentCity>
  <currentProvince>NS</currentProvince>
  <currentPostalCode>B2W4J4</currentPostalCode>
  <currentCountry>CA</currentCountry>
  <currentTelephoneNumber>4039674216</currentTelephoneNumber>
  <currentCellPhoneNumber></currentCellPhoneNumber>
  <yearsAtCurrentAddress>10</yearsAtCurrentAddress>
  <monthsAtCurrentAddress>1</monthsAtCurrentAddress>
  <currentEmailAddress></currentEmailAddress>
  <previousAddressLine1> </previousAddressLine1>
  <previousAddressLine2></previousAddressLine2>
  <previousCity></previousCity>
  <previousPostalCode></previousPostalCode>
  <previousCountry>CA</previousCountry>
  <employementStatus>F</employementStatus>
  <jobTitle>MANAGER</jobTitle>
  <employementCategory>MA</employementCategory>
  <employerName>YEPTEL</employerName>
  <employerTelephoneNumber>2222222243</employerTelephoneNumber>
  <yearsAtEmployement>10</yearsAtEmployement>
  <monthsAtEmployement>1</monthsAtEmployement>
  <grossAnnualIncome>12299</grossAnnualIncome>
  <monthlyRentMortgageAmount>0</monthlyRentMortgageAmount>
  <bankCardFlag>N</bankCardFlag>
  <bankLoanFlag>N</bankLoanFlag>
  <chequingAccountFlag>N</chequingAccountFlag>
  <savingsAccountFlag>N</savingsAccountFlag>
  <storeCardFlag>N</storeCardFlag>
  <gasCardFlag>N</gasCardFlag>
  <supp1Country>CA</supp1Country>
  <agreedToTermsFlag>Y</agreedToTermsFlag>
  <applicantSignature></applicantSignature>
  <signatureFlag>Y</signatureFlag>
  <signatureMatchFlag>Y</signatureMatchFlag>
  <dateSigned >2013-05-29</dateSigned>
<tuSessionId>1227091</tuSessionId>
<tuExamResult>Y</tuExamResult>
<emailConsentFlag>Y</emailConsentFlag>
<insuranceAgreedFlag>N</insuranceAgreedFlag>
  <insuranceCode>N</insuranceCode>
  <roadsideOnRequestFlag>N</roadsideOnRequestFlag>
</AccountApplicationRequest>
]]>
                    
                    </RequestBody>
                </p282:RequestBody>
    </soapenv:Body>
</soapenv:Envelope>



--Adjudication Response.

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>ACCOUNT_APPLICATION</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <tns:AccountApplicationResponse>  <tns:accountNumber>lxyuOGC7/cNbAJMpSEF8NGNzZkb42Bq6yUcczPUL/KHb+Xyx1dyLjNkEi0XZB9QHmZ0K62AeEUcvLcuvmN/seXDczgJO42D0yZxtJk82luuFyOTzigl1oO6EzAe0L3+XL2xwGcf/I8FjhBcLVCu1a6ZlywO5c0Is9+0lxdtBqrMUtM8vj9HTCWuVs4qW2l+x3lQ7UCqYN4P4+Stn2xXw6E0gBOc5Hx/r64IklSoUyxJ67wBmGTYQa2Y4kyuPrN6L+IhVgHRgdGtOzm3H36Ne/2+X/ksIzWsO7BFpvhklDvN7QHSB5QpcRJ37RoHakOZI0b/c2sVghtXC8VPU83e+ps+sF1yiuFuAbQV8LPBTHW/Rg61Cn3azR43CPrCDkH/8nCksnpC/EJLy1qRvPlz1UBeMesgOcYx/jC9LfY9DdbNtp+z0vDMSx6ZX6ejhf+a/QdtuKGurztVjT7KFJH2Q02CPEre17Kl38r8bbrHzcjbgwWQNEWHlf5mw9IasOFKX/aav53+3vIHIvhwyozmGaLjb3EMBHDtVY69BtCO9kj3y/0SYNMUx1HCUuweuDeNFYmovGKcPQMh2FNR2Ky9iTVs2j+qLYYnKPzWIOpI3uUczoM4yCFEHtsYNhRL4MTQtfXvUk3J7ZAME7qQnJZBW8BIlMPEb1AI83Ng3Cv4JCog=</tns:accountNumber>  <tns:expiryDate>1708</tns:expiryDate>  <tns:creditLimit>1000</tns:creditLimit>  <tns:apr>19.99</tns:apr>  <tns:cashApr>21.99</tns:cashApr>  <tns:appStatus>APPROVED</tns:appStatus>  <tns:customerValueInd>0</tns:customerValueInd></tns:AccountApplicationResponse>]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>